import Foundation

struct RegionData {
    let cities: [String] = ["서울시", "강원도", "경기도", "경상도", "광주시", "대구시", "대전시", "부산시", "울산시", "인천시", "전라도", "충청도", "제주시"]
    
    let seoul: [String] = ["강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구"]

    let gangwon: [String] = ["강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군",
                             "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시",
                             "평창군", "홍청군", "화천군", "횡선군"]
    
    let gyeonggi: [String] = ["가평군", "강화군", "고양시", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시", "성남시", "수원시", "시흥시", "안산시", "안성시", "안양시", "양주시", "양평군", "여주군", "연천군", "오산시", "옹진군", "용인시", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시", "인천시청"]
    
    let gyeongsang: [String] = ["거제시", "거창군", "경산시", "경주시", "고령군", "고성군", "구미시", "군위군", "기장군", "김천시", "김해시", "남해군", "달성군", "마산시", "문경시", "밀양시", "봉화군", "사천시", "산청군", "상주시", "성주군", "안동시", "양산시", "영덕군", "영양군", "영주시", "영천시", "예천군", "울릉군", "울주군", "울진군", "의령군", "의성군", "진주시", "진해시", "창녕군", "창원시", "청도군", "청송군", "칠곡군", "통영시", "포항시", "하동군", "함안군"
    , "함양군", "합천군"]
    
    let gwangju: [String] = ["남구", "동구", "북구", "서구"]
    
    let daegu: [String] = ["달서구", "수성구", "남구", "달성군", "동구", "북구", "서구", "수성구", "중구"]
    
    let daejeon: [String] = ["대덕구", "동구", "서구", "유성구", "중구"]
    
    let busan: [String] = ["강서구", "금정구", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구", "기장군"]
    
    let ulsan: [String] = ["남구", "동구", "북구", "울주군", "중구"]
    
    let incheon: [String] = ["강화군", "계양구", "남구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "중구"]
    
    let jeolla: [String] = ["강진군", "고창군", "고흥군", "곡성군", "광양시", "구례군", "군산시", "김제시", "나주시", "남원시", "담양군", "목포시", "무안군", "무주군", "보성군", "부안군", "순창군", "순천시", "신안군", "여수시", "영광군", "영양군", "완도군", "완주군", "익산시", "임실군", "장성군", "장수군", "장흥군",
    "전주시", "정읍시", "진도군", "진안군", "함평군", "해남군", "화순군"]
    
    let chungcheong: [String] = ["갈매로", "계룡시", "고운동", "공주시", "괴산군", "금산군", "나리로", "남세종로", "노을3로", "논산시", "누리로", "다솜1로", "다정남로", "단양군", "달빛로", "당진시", "대평로", "보령시", "보은군", "부여군", "서산시", "아름동", "아산시", "연기군", "영동군", "예산군", "옥천군", "음성군", "제천시", "조치원읍", "증평군", "진천군", "천안시", "청양군", "청원군", "청주시", "충주시", "태안군", "홍성군"]
    
    let jeju: [String] = ["서귀포시", "제주시"]
    
    // 경도, 위도 데이터
    let LngLat: [String : (Double, Double)] = ["서울시 강남구" : (128.8784972, 37.74913611), "서울시 강동구" : (127.1258639, 37.52736667)
                                               , "서울시 강북구" : (127.0277194, 37.63695556), "서울시 강서구" : (126.8516675, 37.54815556),
                                               "서울시 관악구" : (126.9538444, 37.47538611), "서울시 광진구" : (127.0845333, 37.53573889),
                                               "서울시 구로구" : (126.8895972, 37.49265), "서울시 금천구" : (126.9041972, 37.44910833),
                                               "서울시 노원구" : (127.0583889, 37.65146111), "서울시 도봉구" : (127.0495222, 37.66583333),
                                               "서울시 동대문구" : (127.0421417, 37.571625), "서울시 동작구" : (126.941575, 37.50965556),
                                               "서울시 마포구" : (126.9105306, 37.56070556), "서울시 서대문구" : (126.9388972, 37.5763667),
                                               "서울시 서초구" : (127.0348111, 37.48078611), "서울시 성동구" : (127.039, 37.56061111 ),
                                               "서울시 성북구" : (127.0203333, 37.58638333), "서울시 송파구" : (127.1079306, 37.51175556),
                                               "서울시 양천구" : (126.8687083, 37.51423056), "서울시 영등포구" : (126.8983417, 37.52361111),
                                               "서울시 용산구" : (126.9675222, 37.53609444), "서울시 은평구" : (126.9312417, 37.59996944),
                                               "서울시 종로구" : (126.9816417, 37.57037778), "서울시 중구" : (126.9996417, 37.56100278),
                                               "서울시 중랑구" : (127.0947778, 37.60380556), "강원도 강릉시" : (128.8784972, 37.74913611)
    ]
    
    static var myLgtLat: (Double, Double) = (0, 0)
}
