import Foundation

struct RegionData {
    let cities: [String] = ["서울", "강원", "경기", "경상", "광주", "대구", "대전", "부산", "울산", "인천", "전라", "제주", "충청"]
    
    let seoul: [String] = ["강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구"]

    let gangwon: [String] = ["고릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군",
                             "영월군", "원주시", "인제군", "정선군", "철원군", "춘천시", "태백시",
                             "평창군", "홍청군", "화천군", "횡선군"]
    
    
}
